[
    {
        "title":"1. HTML (HTML 5)",
        "subtitle":"This is the first and foremost thing anyone serious about web development",
        "img_url":"https://1.bp.blogspot.com/-hfQhtplCVHI/Xg7WprCTb5I/AAAAAAAAcSI/XK2zORpqgLA-EINGBPe9JVh2V1lcQzshQCLcBGAsYHQ/w400-h225/Learn%2BHTML%2B5%2BProgramming%2Bfrom%2BScratch%2BUdemy%2Bcourse%2Bpreview.jpg",
        "detail":"\nshould learn. It's probably the oldest web technology out there and also the first one I learned long ago, but it's still relevant, and you just cannot become a Web Developer without a good knowledge of HTML. Technically it's a markup language and used to specify the structure of your page.\n\n Nowadays, it's very rare for anyone to create a web page by writing HTML. Instead, most of the webpage you see is generated by an advanced framework like Angular and React. Still, if you want to understand, debug, and solve problems, you must know essential HTML tags like div, span, title, headers, etc.\n\nEven if you know HTML, there is no harm in updating yourself with the latest development, and if you want to start from scratch, I suggest you join the Learn HTML 5 Programming from Scratch course on Udemy. It also covers CSS, which we'll discuss next in the list.\n\n"
    },
    {
        "title":"2. Advanced CSS (Flexbox and Grid)",
        "subtitle":"Apart from HTML, if there is another irreplaceable web technology is then it must be CSS 3",
        "img_url":"https://1.bp.blogspot.com/-WpO0W1Ukq7E/Xg7WL3uXWeI/AAAAAAAAcR0/QwV2ZZLSKPQJY1UiBktaPjMkzvQJyATRwCLcBGAsYHQ/s400/Advanced%2BCSS%2Band%2BSass%2BFlexbox%252C%2BGrid%252C%2BAnimations%2Band%2BMore%2BUdemy%2Bcourse.jpeg",
        "detail":"or Cascading Style Sheet. CSS is used to style your web page, I mean to make it look more beautiful. You can also use CSS to specify the layout of the element.\n\nJust like HTML, it's scarce now to style your web pages by writing CSS classes by hand, instead of many people and the team use a framework like Bootstrap, Tailwind CSS, Materialize, etc. Like HMTL, CSS is also evolving, and now you have things like Flexbox and Grid.\n\nSince it's absolutely essential for any project you work on to look more beautiful, you have to learn CSS. If you are a beginner, I suggest you start with barebone CSS and then move onto these new developments like Flexbox and Grid.\n\nIf you need a resource, I recommend Advanced CSS and Sass: Flexbox, Grid, Animations, and More! Course, which not only covers CSS from scratch but also teaches you Flexbox and Grid, which is going to serve you well in 2021."
        
    },
    {
        "title":"3. Advanced JavaScript",
        "subtitle":"This is the third most essential thing any Web developer should learn; in fact, without JavaScript,Read ",
        "img_url":"https://www.guimee.com/file/pic/adblog/5eb718aa4d4df.jpg",
        "detail":"the Web would not have been where it is today. When I learned JavaScript, people told me that it put life in your webpage, it can make your webpage interactive.\n\nLike you can do things when someone clicks buttons, you can change animations and look and feel of your webpage when the user moves the mouse, etc. All those are still true, but JavaScript now offers much more. In fact, you can develop a complete web application end-to-end just using JavaScript.\n\nIt has evolved from an essential frontend programming language to a full-stack language, which also allows you to write backend code. This was made possible by Nodejs, another necessary framework for web developers.\n\nhe bottom line is, JavaScript is absolutely a must for any Web Developer, both frontend and backend, and you should definitely spend some time learning JavaScript in 2021. If you need a resource, I recommend The Complete JavaScript 2021: Build Real Project class by Jonas Schmedtmann on Udemy, which is a great course to learn JavaScript in depth. It's equally useful for both beginners and experienced Web Developers.\n\n10 things every frontend developer should learn\n\nBy the way, JavaScript is still evolving, and now we have things like WebAssembly, which allows you to run code as fast as C, C++, and Rust in your browser."
    },
    {
        "title":"4. React.js",
        "subtitle":"As I have mentioned in the previous paragraph that Web Development ",
        "img_url":"https://www.mobinius.com/wp-content/uploads/2020/02/reactjs-2.png",
        "detail":"As I have mentioned in the previous paragraph that Web Development, particularly frontend development, has come a long way in the last decade. Now, you don't need to write HTML and CSS to create your webpages, like many other web developers and I have done in the late nineties and early 2000s.\n\nNow, you have a framework like React, which can dynamically generate web pages for you. That's why a web developer needs to learn a frontend framework like React.\n\nIf you want to learn to React in 2021 and looking for a recommendation, I suggest you join Maximilian's The Complete React Guide (with Hooks) course, which is the most up-to-date and also covers React Hooks, an essential concept to master in 2021.\n\n10 Technologies every Web developer should learn\n\nBtw, React is not the only one out there, in fact, there are many other frontend frameworks that are as powerful as React like Angular, Vuejs, Svelete.js but I recommend React because it has adopted by many companies, both small and large and I think it is here for a long run."
    },
    {
        "title":"5. NPM (Node Package Manager)",
        "subtitle":"Now that we have covered the most essential programming language and framework for frontend development",
        "img_url":"https://1.bp.blogspot.com/-M1N0Q3kySwU/Xg7U-HKUXII/AAAAAAAAcRA/g4MHPLvQbvUb5mZf3vC1rLZmT9TWYDCrACLcBGAsYHQ/s400/The%2BComplete%2BNode%2BJS%2Bdeveloper%2Budemy%2Bcourse.jpg",
        "detail":"Now that we have covered the most essential programming language and framework for frontend development, it's time to look at essential tools or web development, and first, one of them is NPM. If you don't know, now you don't need to write code for everything you need.\n\nFor example, if you want to generate dynamic web pages, you don't need to write a framework, someone else has already written, and you can just import them to use in your project. All this was made possible because of NPM or Node Package Manager. It's the world's biggest software registry and hosts more than 800,000 code packages.\n\nTechnically, NPM is a package manager of the JavaScript programming language. It is also the default package manager of Node.js, which provides a JavaScript runtime environment for server-side development.\n\nIt consists of a command-line client called npm for downloading those modules and also hosts both public and private packages online. You generally learn about NPM when you learn nodejs, but even if you don't know node, you should learn NPM. If you need a resource, I recommend Andrea Mead and Rob Percival's The Complete Node.js Developer Course on Udemy, one of my favorite courses to learn Nodejs from scratch."
    },
    {
        "title":"6. Chrome Developer Tools",
        "subtitle":"This is another essential tool for Web Developers, particularly frontend developers.",
        "img_url":"https://timeweb.com/ru/community/article/cc/cc80ce9459e66652beff9cec4f47baf7.jpg",
        "detail":"When it comes to code, the IDE is your most important tool, and as a Java developer, I always feel lucky that we have not one but three top-class IDE - Eclipse, NetBeans, and IntelliJIDEA. For a long, when I do web development, I think we don't have any tools which can compete with IDEs like these.\n\nNo doubt that you can use them for web development, too, but it makes more sense for Web developers who use Java in the backend. Microsoft VSCode changed that thing and has come along as the most potent IDE or Editor for Web Development. Compared to those fat IDEs, VSCode is also very lightweight and highly configurable.\n\nYou have plugins for almost anything from developing frontend to connecting to a cloud-like AWS, Azure, and GCP and deploying your application. If you want to become a proficient Web Developer in 2021, I suggest you learn VSCode in 2021, and if you already know, just learn more like shortcuts, new extensions, etc. If you need a resource, then John Papa's The Visual Studio Code course on Pluralsight is the best one to start with."
    }
]

